---
kind: property
id: P:Autodesk.Revit.DB.Structure.RebarContainer.ScheduleMark
source: html/45faac1a-a8ec-2df3-4cfd-8d49b98ee92b.htm
---
# Autodesk.Revit.DB.Structure.RebarContainer.ScheduleMark Property

The Schedule Mark parameter. On creation, the Schedule Mark is set
 to a value that is unique to the host, but it can be set to
 any value.

## Syntax (C#)
```csharp
public string ScheduleMark { get; set; }
```

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentNullException** - When setting this property: A non-optional argument was null